/*+===================================================================
	File: FileUtil.hpp
	Summary: （このファイルで何をするか記載する）
	Author: AT13C192 23 藤原佑埜
	Date: 2025/07/22 16:51 初回作成
	（これ以降下に更新日時と更新内容を書く）
===================================================================+*/
#pragma once

// ==============================
//	include
// ==============================
#include <string>
#include <Shlwapi.h>

// ==============================
//	Linker
// ==============================
#pragma comment(lib, "Shlwapi.lib")

// ==============================
//	関数宣言
// ==============================
/**
 * @brief 指定されたファイル名のファイルパスを検索します。
 * @param [filename] 検索するファイル名を指すワイド文字列ポインタ。
 * @param [result] 見つかったファイルのパスを格納する std::wstring 参照。
 * @return ファイルパスが見つかった場合は true、見つからなかった場合は false を返します。
 */
bool SearchFilePath(const wchar_t* filename, std::wstring& result);
